OVJ1_1_2.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="OVJ">
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OVJ1.1">
        <stringProp name="ThreadGroup.num_threads">${noOfUsers}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${rampUp}</stringProp>
        <stringProp name="ThreadGroup.duration">${testDuration}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments">
            <elementProp name="BASE_URL" elementType="Argument">
              <stringProp name="Argument.name">BASE_URL</stringProp>
              <stringProp name="Argument.value">foundry.abbvienet.com</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="AUTH_TOKEN" elementType="Argument">
              <stringProp name="Argument.name">AUTH_TOKEN</stringProp>
              <stringProp name="Argument.value">Bearer eyJwbG50ciI6IldLL3dDZjdtU2cycUVpM1MyYVVaUmc9PSIsIm</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="testDuration" elementType="Argument">
              <stringProp name="Argument.name">testDuration</stringProp>
              <stringProp name="Argument.value">${__P(testDuration,1800)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="csvPath" elementType="Argument">
              <stringProp name="Argument.name">csvPath</stringProp>
              <stringProp name="Argument.value">${__P(csvPath)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="noOfUsers" elementType="Argument">
              <stringProp name="Argument.name">noOfUsers</stringProp>
              <stringProp name="Argument.value">${__P(noOfUsers,1000)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="rampUp" elementType="Argument">
              <stringProp name="Argument.name">rampUp</stringProp>
              <stringProp name="Argument.value">${__P(rampUp,600)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Load_GW_KPI_${KPIID}">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/v2/ontologies/default/queries/growthKpis/execute</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;parameters&quot;:{&quot;salesscenario&quot;:&quot;percent&quot;,&quot;hierarchyType&quot;:&quot;Branch&quot;,&quot;metricField&quot;:&quot;quantity&quot;,&quot;kpiId&quot;:&quot;${KPIID}&quot;,&quot;objType&quot;:&quot;${objtype}&quot;,&quot;filterStr&quot;:&quot;{\&quot;date\&quot;:{\&quot;value\&quot;:[\&quot;2024-07-01\&quot;,\&quot;2025-06-30\&quot;],\&quot;type\&quot;:\&quot;date\&quot;,\&quot;operation\&quot;:\&quot;range\&quot;}}&quot;,&quot;priorFilterStr&quot;:&quot;{\&quot;date\&quot;:{\&quot;value\&quot;:[\&quot;2023-07-01\&quot;,\&quot;2024-06-30\&quot;],\&quot;type\&quot;:\&quot;date\&quot;,\&quot;operation\&quot;:\&quot;range\&quot;}}&quot;,&quot;useFilterStr&quot;:true}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Load_Obj_${QueryName}">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/v2/ontologies/default/queries/${QueryName}/execute</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;parameters&quot;: {&#xd;
    &quot;useFilterStr&quot;: true,&#xd;
    &quot;filterStr&quot;: &quot;{\&quot;countryName\&quot;:{\&quot;value\&quot;:[\&quot;Japan\&quot;],\&quot;type\&quot;:\&quot;array\&quot;},\&quot;countryId\&quot;:{\&quot;value\&quot;:[\&quot;JPN\&quot;],\&quot;type\&quot;:\&quot;array\&quot;},\&quot;date\&quot;:{\&quot;value\&quot;:[\&quot;2024-08-01\&quot;,\&quot;2025-07-02\&quot;],\&quot;type\&quot;:\&quot;date\&quot;,\&quot;operation\&quot;:\&quot;range\&quot;}}&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Filter_ThArea_${KPIID}">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/v2/ontologies/default/queries/growthKpis/execute</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;parameters&quot;:{&quot;kpiId&quot;:&quot;${KPIID}&quot;,&quot;objType&quot;:&quot;${objtype}&quot;,&quot;filterStr&quot;:&quot;{\&quot;countryId\&quot;:{\&quot;value\&quot;:[\&quot;JPN\&quot;],\&quot;type\&quot;:\&quot;array\&quot;},\&quot;date\&quot;:{\&quot;value\&quot;:[\&quot;2024-08-01\&quot;,\&quot;2025-07-01\&quot;],\&quot;type\&quot;:\&quot;date\&quot;,\&quot;operation\&quot;:\&quot;range\&quot;},\&quot;therapeuticAreaName\&quot;:{\&quot;value\&quot;:[\&quot;Neuroscience\&quot;,\&quot;Immunology\&quot;,\&quot;Oncology\&quot;],\&quot;type\&quot;:\&quot;array\&quot;}}&quot;,&quot;priorFilterStr&quot;:&quot;{\&quot;countryId\&quot;:{\&quot;value\&quot;:[\&quot;JPN\&quot;],\&quot;type\&quot;:\&quot;array\&quot;},\&quot;date\&quot;:{\&quot;value\&quot;:[\&quot;2023-08-01\&quot;,\&quot;2024-07-31\&quot;],\&quot;type\&quot;:\&quot;date\&quot;,\&quot;operation\&quot;:\&quot;range\&quot;},\&quot;therapeuticAreaName\&quot;:{\&quot;value\&quot;:[\&quot;Neuroscience\&quot;,\&quot;Immunology\&quot;,\&quot;Oncology\&quot;],\&quot;type\&quot;:\&quot;array\&quot;}}&quot;,&quot;useFilterStr&quot;:true}}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">accept-language</stringProp>
              <stringProp name="Header.value">en-AE,en-GB;q=0.9,en-US;q=0.8,en;q=0.7</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">authorization</stringProp>
              <stringProp name="Header.value">${AUTH_TOKEN}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">content-type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">fetch-user-agent</stringProp>
              <stringProp name="Header.value">typescript-sdk/0.247.0 typescript-sdk-generator/1.3.16 osdk-legacy-client/2.5.6</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">priority</stringProp>
              <stringProp name="Header.value">u=1, i</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">sec-ch-ua</stringProp>
              <stringProp name="Header.value">&quot;Google Chrome&quot;;v=&quot;137&quot;, &quot;Chromium&quot;;v=&quot;137&quot;, &quot;Not/A)Brand&quot;;v=&quot;24&quot;</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">sec-ch-ua-mobile</stringProp>
              <stringProp name="Header.value">?0</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">sec-ch-ua-platform</stringProp>
              <stringProp name="Header.value">&quot;Windows&quot;</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">sec-fetch-dest</stringProp>
              <stringProp name="Header.value">empty</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">sec-fetch-mode</stringProp>
              <stringProp name="Header.value">cors</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">sec-fetch-site</stringProp>
              <stringProp name="Header.value">same-site</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Referer</stringProp>
              <stringProp name="Header.value">https://nga-dev.foundry.abbvienet.com/</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Referrer-Policy</stringProp>
              <stringProp name="Header.value">strict-origin-when-cross-origin</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
          <stringProp name="filename">C:\Users\MUSTARX1\Downloads\results (1).jtl</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">C:\Users\MUSTARX1\Downloads\results (1).jtl</stringProp>
          <boolProp name="useGroupName">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
          <stringProp name="filename">C:\Users\MUSTARX1\Downloads\results.jtl</stringProp>
          <boolProp name="useGroupName">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">${csvPath}</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">KPIID,objtype,QueryName</stringProp>
        </CSVDataSet>
        <hashTree/>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer">
          <stringProp name="ConstantTimer.delay">10000</stringProp>
        </ConstantTimer>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>